workstation/openfoam-master-tutorials/tutorials/incompressible/adjointOptimisationFoam/shapeOptimisation/motorBike/system/decomposeParDict.20
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 20;

method          hierarchical;
// method          ptscotch;

coeffs
{
    n           (5 2 2);
}


// ************************************************************************* //
